---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.Transparency
source: html/4be37b9f-d5e8-afb2-0910-dd6a398e7f67.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.Transparency Property

Transparency percentage of deformed shape color fill on surfaces

## Syntax (C#)
```csharp
public int Transparency { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentsInconsistentException** - When setting this property: transparency is less than 0 or greater than 100